{
  "id": 5,
  "title": "Case 5 – The Gallery After Dark",
  "culprit": "veronica",
  "brief": "Midnight at Lindsay’s gallery — champagne chatter, velvet ropes, paintings lit like confessions. The victim raises a glass during the final toast, smiles… and folds to the floor.\n\nPoison — silent, elegant, no struggle. In a room full of witnesses, someone slipped death into crystal.\n\nZOE ran the bar.\nLINDSAY curated the night.\nVERONICA stood glowing beneath spotlights — star of the exhibition.\n\nThree hands touched the glasses. Only one needed applause enough to kill for it.",
  "wrenHint": "Watch the performance, not the stage.\n\n• Everyone’s eyes were on Veronica during her big speech — except when the lights dipped for her projection piece.\n• The poison matches a cleaning agent kept behind Zoe’s bar — but it’s missing only a thimble.\n• Lindsay stayed glued to donors… until that jammed curtain dragged her across the room.\n\nSomeone needed a moment unobserved — and the blackout gave her center stage.",
  "answers": {
    "zoe": [
      "Bar was chaos. Orders everywhere. I shake, pour, smile — that is the job. No time for murder between refills and broken champagne corks.",
      "He wanted something fancy, then complained it was too sweet. I remember him because he tipped coins instead of notes. That is not motive — that is Tuesday.",
      "If my prints are on his glass, of course they are — I served half the room. But the agent you found is under lock and rag. Bar staff do not touch cleaner during service."
    ],
    "lindsay": [
      "A host never rests. Donors want hands shaken, sponsors want praise, lights want miracles. I do not stand still long enough to poison toast and make it look graceful.",
      "He financed this exhibition, but he wanted naming rights large enough to cover the moon. We argued — yes — but a dead patron funds nothing.",
      "Fingerprints? Mine are on every table, every glass, every frame. I set the place myself. If you chase prints, you will drown in mine. Timing matters more than touch."
    ],
    "veronica": [
      "I drifted between admirers, spoke poetry about canvas and silence. When the projection began, the room dimmed — my world for twenty seconds. The audience watched light, not hands.",
      "He saved my show when no one else would. In return he wanted everything — attention, ownership, credit written in glitter. He loved art the way gamblers love debt collectors.",
      "We toasted. He raised his glass too high. I sipped — then smiled — then returned it to his hand when the cameras turned. If something else entered the drink afterward, it wasn’t from mine… unless it was already there."
    ]
  },

  "successEnding": "{culprit}'s poise cracks when you replay the blackout.\n\nTwenty seconds of darkness. Her glass in his hand. A dressing-room bottle of cleaner missing just enough to kill — subtle, theatrical, bitter as applause withheld.\nCrowd gasps become alibis. She needed him alive until the speech… and silent after.\n\nSecurity escorts her past her own paintings — all eyes finally on the star she made herself.",

  "failureEnding": "You fix on {accused} — the barmaid too close to the cleaner, or the curator who vanished behind a curtain.\nThey fumble explanations until one sticks enough for custody.\n\nHours later, Wren calls. The projection blackout, the swapped glass, the missing agent — every line draws back to {culprit} instead.\nHer show opens tomorrow, critics flocking. The city calls it brilliance.\nOnly you know the price of the performance."
}
