{
  "id": 6,
  "title": "Case 6 – The Alley Patrol",
  "culprit": "chris",
  "brief": "Rain turns the alley to mirror-black stone. Behind Darren’s bar, a body lies face-down, pockets inside-out, blood washing thin in the gutter.\nNo witnesses. Just bins overflowing like confessions and one blurred boot print smearing through the mud.\n\nThree people drift through that narrow cut of bricks tonight:\nLINDSAY — donor, meeting the bar in polite daylight.\nCAROL — archivist, shortcut through puddles to get home.\nCHRIS — patrol officer, badge bright enough to scare thieves to church.\n\nAll swear they passed through.\nBut only one walked slow enough to finish what started.",
  "wrenHint": "Watch the paperwork — lies stain forms as well as alleys.\n\n• Chris’s patrol log places him on three streets at once — unless someone edited the time stamps.\n• Lindsay says she left early, but the bar till shows her buying a second drink long after.\n• Carol’s shoes miss the boot print… but her umbrella’s smear matches the arc perfectly.\n\nThe victim wasn’t robbed — he was targeted.\nAsk who knew when the alley would empty, and who carries authority like camouflage.",
  "answers": {
    "lindsay": [
      "I spoke to Darren about auction pieces — nothing scandalous. One drink, maybe two. I stepped out for air once the music churned. If I lingered, it was only for quiet.",
      "He threatened to pull funding unless I changed a catalogue to flatter him. I wanted his money, not his approval. Irritation does not make me a murderer.",
      "Fingerprints on a doorframe? Would not surprise me. I leaned outside between speeches. Rain makes a gallery girl wilt, detective — I left quickly."
    ],
    "carol": [
      "My route home never changes — main road, left by the bar, down the alley because I value minutes more than dry shoes. Tonight I cursed every puddle.",
      "He wanted old files erased. Said history makes enemies. I said retention makes laws. We parted cold but legal.",
      "If prints are near the body, it is from steadying myself on wet stone. I don’t stop in alleys longer than it takes to pray I don’t slip."
    ],
    "chris": [
      "Patrol keeps to the lights. Alleys hide shadows and shadows hide trouble. I check them early, not when rain turns them slick like ice.",
      "He hated uniforms near his deals. Said police attention spooks clients. Maybe it did. Told him we keep alleys clean of bodies — guess I was wrong.",
      "If you found prints on bins or fire escapes, they’re old sweeps. Kids climb for kicks. But tonight? I never stepped back there. Rain makes evidence messy."
    ]
  },

  "successEnding": "Chris stiffens when you lay out the logs.\n\nThree streets at one time. Rainwashed alley. A single blurred boot print matching patrol tread. He stalled the victim, flipped the pockets, staged robbery — but the logbook betrayed him.\n\nWhen the cuffs click, he doesn’t argue. Just lowers his badge into your hand, like he’s been waiting for someone to take it.",
  
  "failureEnding": "You lean too hard on {accused}, build a case from puddles and panic. They break — or simply get tired — and the holding cell doors close.\n\nWren calls later. Patrol logs were forged. The boot print isn’t random — it’s regulation issue. Only {culprit} walked that alley with authority and the time to finish business.\n\nRain keeps falling. The wrong one sits behind bars.\nThe right one? Patrol resumes like nothing happened."
}
