{
  "id": 4,
  "title": "Case 4 – The Riverwalk Meeting",
  "culprit": "emma",
  "brief": "Dawn breaks over the riverwalk — cold light, colder body.\nA financier sits slumped on a bench, coat straight, shoes polished, briefcase missing. No fight, no blood. Just a dark fingerprint on the throat like someone pressed the life out of him in a single quiet moment.\n\nThree people orbit the scene:\nPETER — riverwalk engineer, always fixing generators before the frost bites.\nEMMA — accountant with a talent for shell companies and vanishing funds.\nLAWSON — business partner claiming a quiet night at home.\n\nNo cameras. Only footprints in the frost, walking beside his until one set stops.",
  "wrenHint": "Follow the paper trail, not the river.\n\n• Large transfers leave the victim's accounts hours before death.\n• Emma signs off every one — clean on paper, dirty under a lamp.\n• Peter's maintenance logs put him near the bridge, not the bench.\n• Lawson's alibi cracks — payphone call near his street, not his home.\n\nAsk who loses everything if the auditors open the books tomorrow… and who gains time if he never sees morning.",
  "answers": {
    "peter": [
      "Frost ate through the contacts again. I spent half the night coaxing a generator under the bridge like a stubborn mule. Hands numb by sunrise. Not the mood for murder.",
      "We crossed paths twice — once over a blackout, once over an unpaid bill. He cared more about appearances than workers. I've no love for him, but no reason to choke a rich man on a bench.",
      "If you found my prints there, I believe you. I sat down to smoke, shake warmth back into my fingers. Hardly glamorous — I leave the theatrics to killers and accountants."
    ],
    "emma": [
      "Books don’t keep themselves, detective. I worked under a lamp until dawn. Neighbours can vouch for the glow under my door and the tapping of keys. Auditors breathe down my neck; I breathe back numbers.",
      "He trusted me because I made empires look honest. Shell companies, invisible pathways. If he falls, the whole house shakes — including mine. Killing him sounds like sawing through my own floorboards.",
      "Bench prints? We met there sometimes. Quiet, no cameras. A place to pass sealed envelopes and shake nervous hands. If someone killed him there, they borrowed my office under open sky."
    ],
    "lawson": [
      "Quiet night in. Whisky, jazz, regrets — pick an order. Neighbours hear everything through those cheap walls. They'll tell you when I turn Coltrane too loud.",
      "Business tied us together, murder would tear half the city down. He was worth more breathing than dead — to all of us.",
      "My hands were on that briefcase for years. Blueprints, contracts, late nights. If it’s at the bottom of a river now, someone wanted the paperwork gone."
    ]
  },

  "successEnding": "{culprit} freezes when you lay out the transfers.\n\nMoney leaking hours before death. A missing briefcase full of shell trails. A riverwalk meeting place she used like a confession booth.\nEmma didn’t just clean books — she erased them.\nA quiet squeeze to the throat, a bench to stage calm, frost to hide anger.\n\nShe closes her eyes when the cuffs click, already counting years instead of dollars.",

  "failureEnding": "You corner {accused} with half-truths and riverbank footprints.\nThey protest, plead, or crack — whichever way, you drag them into holding.\n\nLater, Wren calls. Transfers traced. Signatures matched. The missing briefcase bought someone time — and that someone was {culprit}.\n\nDawn breaks again over the river. Mist curls like smoke. The real killer walks free a while longer, ledger balanced in blood."
}
