{
  "id": 9,
  "title": "Case 9 – The Newspaper Stand",
  "culprit": "lawson",
  "brief": "Dawn warms the street but the pavement stays cold. A paperboy finds a body slumped beside the newsstand — coat open, pockets turned, briefcase gone like the others.\nThe owner swears he heard raised voices: one deep, confident, wearing a suit that didn't belong on a tired street.\n\nThree names circle like headlines:\nLAWSON — partner to too many dead men.\nCAROL — archivist with a window view of every whispered deal.\nISSAC — workshop lights burning long past midnight.\n\nEveryone calls it coincidence.\nCoincidence is getting hard to believe.",
  "wrenHint": "History repeats in sharper ink.\n\n• Lawson survives again — richer each time someone falls.\n• Carol hears voices but sees no fight; guilt leaves shadows, not words.\n• Issac bought heavy cable last night — but no device is wired here.\n\nAsk who profits from another missing briefcase.\nAsk who keeps showing up alive when others don’t.",
  "answers": {
    "lawson": [
      "I walk that street every night. Habits hold a man together when the markets don’t. Last night I passed the stand — nodded, kept moving. Paper seller chats too much for midnight.",
      "The victim was leverage — on banks, on rivals, occasionally on me. Killing leverage is like burning credit. Only fools and desperate men do it.",
      "Fingerprints on benches, kiosks, lampposts? I built half this district shaking hands. Presence is not guilt — unless you need it to be."
    ],
    "carol": [
      "I heard voices, yes. The paper seller and someone in a fine coat. By the time I reached the window, rain streaked the glass and the street was empty. Words dissolve quicker than steam.",
      "He misplaced a file once and begged for miracles. I told him history always returns — even if men don't.",
      "If prints of mine linger on that kiosk, they pay for the morning paper. I don’t climb over counters — my shoes protest the idea."
    ],
    "issac": [
      "Workshop closes late. Shutters scream like dying engines. If I fought anyone, half the block would’ve heard. I fix problems — don’t create them in alleys.",
      "He wanted illegal power routes — taps hidden behind walls. I said no. A licence feeds families longer than favour.",
      "If my fingerprints rest on that lamppost, it’s from idle talk about football. Engineers lean; murderers shove."
    ]
  },

  "successEnding": "{culprit} exhales like a man relieved the waiting is over.\n\nToo many deaths. Too many wills shifting like tides. Another briefcase gone, another partner silent. Lawson’s story folds when you line them in order — five victims, one survivor with pockets swelling.\n\nHe straightens his tie, offers wrists like concessions. ‘Markets reward consolidation,’ he mutters.\nTonight, the papers print his name — finally below the fold.",
  
  "failureEnding": "You drag {accused} in — the archivist with thin windows, or the engineer with loud shutters.\nThe report reads neatly. Too neatly.\n\nHours later Wren calls:\nAnother briefcase resurfaces on the black market, pages torn out — evidence curated like art.\nThe signature buyer? Someone traced back to {culprit}.\n\nBlock 2 tightens. The wrong suspect cools in holding.\nThe real suit walks home under headlines he helped write."
}
