{
  "id": 8,
  "title": "Case 8 – The Rooftop Whisper",
  "culprit": "darren",
  "brief": "Wind claws at the rooftop above Darren’s bar — neon flicker, puddles shaking with bass from below. A hat in the alley, a body by the low wall, one step from the drop that finished him.\n\nThree threads tie to the terrace:\nEMMA — numbers and cigarettes behind office doors.\nZOE — bartender buried in receipts.\nDARREN — owner, keys jangling like guilt.\n\nMusic swallowed every cry.\nWho pushed when the night was loud enough to hide murder?",
  "wrenHint": "Follow access, not alibis.\n\n• Terrace keys belong to staff — mostly Darren.\n• Zoe cashes out during time of death; cameras catch her till-side.\n• Emma stepped out for a smoke — but not to the roof, unless someone let her up.\n\nThe killer wasn’t a ghost in the wind. They were someone who knew exactly when the music would drown a fall.",
  "answers": {
    "emma": [
      "I stepped outside, yes — alley door, not the terrace. Heat in that bar could steam a window. I wanted cold air, not a scenic view of regret.",
      "He was more debt than client by the end. Killing him is like cutting off your own arm to lower the weight — possible, but inconvenient.",
      "Fingerprints on the railing? If they’re there, they’re old. I count debts leaning on metal more often than I push people over it."
    ],
    "zoe": [
      "When the private party headed upstairs, I was wrist-deep in stacked glasses and angry receipts. Rooftops are for rich people and smoke breaks — I handle the fallout below.",
      "He nursed his drink like someone expecting applause for breathing. I serve, I smile, I forget — that’s the job.",
      "If prints of mine survive up there, they’ve aged worse than champagne in sunlight. I carried crates once for a wedding. Since then? No interest."
    ],
    "darren": [
      "I check that roof sometimes — lights blow, smokers sneak. Last night the bar was a storm. Fights for tabs, egos too big for one room.",
      "He owed me money. Sure. But I wanted him sober enough to pay it, not sprawled across tiles dripping rain and reputation.",
      "Of course my prints are on the rail. I own the place. But owning a crime scene isn’t committing the crime."
    ]
  },

  "successEnding": "{culprit} cracks when the music timeline is laid out.\n\nBass peaks. Crowd roars. A moment where no one looks up. Only staff keys open the terrace, and Darren held them like a second spine. Debt heavy, patience thin — one shove disguised as stability, then silence.\n\nHe doesn’t fight. Just stares over the edge, as if expecting the wind to answer for him.",
  
  "failureEnding": "You corner {accused}. A cigarette in the alley, a bartender wiping receipts — easy suspects in bad lighting.\nThey fold or flare, and steel doors click shut.\n\nHours later, Wren calls. Terrace keys logged out under {culprit}. A single boot scrape at the ledge. Bass drop aligned with time of death.\n\nThe wrong name fills the report. Down below, the alley collects hats and mistakes the same way — quietly, without protest."
}
