{
  "id": 10,
  "title": "Case 10 – The Last Statement",
  "culprit": "veronica",
  "brief": "The threads finally tighten. The same financier whose partnerships sparked every death is found in the old Majestic Theatre — slumped in a balcony seat like a man waiting for applause that never came.\n\nLights cold. Foyer empty. Projector still warm.\n\nLAWSON had meetings with him about dissolving assets.\nZOE supplied the bar for a late rehearsal.\nLINDSAY toured the hall with funding on her mind.\nVERONICA rehearsed intimately on that stage.\nISSAC handled wiring backstage.\n\nEveryone here could have sat beside the body.\nOnly one left with a future brighter than his.",
  "wrenHint": "Patterns do not lie — people do.\n\n• Money moves through every case like blood in a vein.\n• Lawson kept accounts breathing — but he needed the man alive.\n• Zoe, Lindsay, Issac all lose more with a corpse than a contract.\n• Veronica alone thrives on tragedy — critics love a fallen patron, a brilliant star stained in gold.\n\nThis is not just a murder. It is a legacy auctioned to the highest bidder.\nChoose carefully — the final headline is yours.",
  "answers": {
    "lawson": [
      "I sat in the back during rehearsal. Took notes. Calculated loss. He had become an anchor tied to my leg — but anchors restrain, they do not require killing.",
      "When a business partner fails, you separate cleanly. You do not stage theatre in the dark. That is drama, not strategy.",
      "Prints on rails, programmes, door handles — yes. I followed him up to argue costs. I also walked back down again while he was still breathing. I let curtains fall on deals, not men."
    ],
    "zoe": [
      "I packed up the bar when the lights dipped. Empty theatres feel like graves — velvet-lined and echoing. I left early.",
      "He paid late but paid. Alive, he bought coffee. Dead, he buys nothing — I do not poison my own profit.",
      "If my fingerprints are on seats or doors, it is from carrying crates and wiping glasses. Routine, not motive."
    ],
    "lindsay": [
      "Art needs space and donors — that theatre has both. I walked the aisles imagining exhibits, not alibis.",
      "We negotiated another loan. Alive, he was leverage. Dead, he is a plaque and paperwork.",
      "Prints on rails? I leaned to whisper there were terms we must revisit. Half the patrons saw us talk — watchers are better defence than innocence."
    ],
    "veronica": [
      "After rehearsal, I walked the stage alone. The boards know every foot that betrays a truth. When I climbed to the balcony, I thought I was the only ghost there.",
      "He raised me high, but his signature always hovered above mine. Talent beneath a thumb eventually breaks or slips away.",
      "Fingerprints behind his seat? I gripped that rail rehearsing a monologue about freedom. He listened. Quietly. Too quietly. Whether he died before or after I let go — you must decide which ending the city applauds."
    ],
    "issac": [
      "The fly tower is a death trap. I came to inspect wiring, not witness the final act. Circuits spark, theatre burns — I prevent that.",
      "He wanted more lights, more power, more spectacle. I told him the system would blow. He sulked like a child denied fireworks.",
      "Prints at the balcony door? The fuse box sits beside it. I opened it. I closed it. My job ends with volts, not venom."
    ]
  },

  "successEnding": "{culprit} finally cracks under the spotlight. \nNot with tears — with a performer’s sigh, stage-ready. You piece together the tour of deaths, each briefcase, each ledger, the moment her star rose as his dimmed.\n\n‘A tragedy needs an ending,’ she whispers, wrist outstretched like curtain call. The press will adore her downfall more than her art.\n\nYou walk her past the orchestra pit. Seats empty. Justice echoes.",
  
  "failureEnding": "You point at {accused}. Evidence stretches to fit — just enough for headlines, not truth.\nThe city gasps, cameras flash, statements are written before ink dries.\n\nHours later Wren calls.\nA fresh exhibit is announced — a posthumous tribute curated by {culprit}. Her face on the billboards, the patron’s death now her myth.\n\nYou solved it neatly, not correctly.\nThe curtain falls — and rises again without you."
}
