{
  "id": 2,
  "title": "Case 2 – The Broken Lift",
  "culprit": "ben",
  "brief": "Same tower. New night.\n\nA service lift grinds to a halt between floors. When maintenance pry it open, they find a trolley, an empty crate, and specks of blood trailing toward the loading bay.\nLater, the victim appears — dead, dumped like freight.\n\nOnly three people had cause to roam that corridor:\nCAROL, records clerk with access to shipment archives.\nBEN, depot runner responsible for moving crates after dark.\nVERONICA, leaving late from a private rehearsal upstairs.\n\nThe lift carried more than cargo.",
  "wrenHint": "Things refuse to add up:\n\n• Two crates are signed into the building, but only one makes it out.\n• Ben keeps shifting the story — first he used the lift, then he swears he took the stairs.\n• Carol’s card logs match her timeline to the second.\n• Veronica had no business in the service wing — and doesn’t pretend otherwise.\n\nFind the route of the missing crate, and you’ll find who rode with the body.",
  "answers": {
    "carol": [
      "I left at eight sharp. Main lift only — that service cage shakes like it's held together with prayers. Lobby guard will remember me; I signed out and wished him goodnight.",
      "He came to me chasing ghosts in old paperwork. Thought a signature here, a missing form there, might scrub his debts clean. I file records, detective — not miracles.",
      "My prints will be on crates. I handle dozens a week. But I don’t ride them like an elevator — I leave that to depot boys and optimists."
    ],
    "ben": [
      "Night shift, same as always. Unloaded two crates, trolleyed them to the service lift. One went up, smooth as butter. Second jammed. I wedged the door, swore at it, and took the stairs instead. Waste of time.",
      "He was just a name. Suits don’t talk to us unless a crate is missing or a deadline burns. I moved boxes; he moved numbers — different worlds.",
      "If you found my prints everywhere, it's because I pushed, pulled, and cursed that crate into place. If you say he was inside it… then someone packed more than freight before I got there."
    ],
    "veronica": [
      "I was upstairs rehearsing, nothing glamorous — just repetition and aching feet. Came in through the front, left through the same. Security cameras will show me doing exactly that.",
      "He sponsored events. Liked applause from the second row. We toasted with sparkling water, nothing scandalous. I barely knew the man beyond the stage lights.",
      "If my prints are on a service lift, it’s by witchcraft. I don’t even touch props unless they’re blessed with good luck. I avoid creaking corridors — they ruin the magic."
    ]
  },

  "successEnding": "{culprit} breaks when the manifest hits the table.\n\nTwo crates booked. Only one delivered. Blood on the trolley wheels, fingerprints on the lift gate — and a timeline that leaves {culprit} alone between floors.\n\nThe body didn’t fall. It was escorted.\nTonight, security lock the depot. Tomorrow, headlines whisper of betrayal in the loading bay.",

  "failureEnding": "You corner {accused} and the pieces almost look like they fit. Almost.\nThey crack under pressure, or maybe they just get tired — either way, the cuffs click.\n\nHours later, Wren calls. Lift logs, crate numbers, and a missing manifest trace the route of the body straight back to {culprit}.\n\nThe wrong person sleeps in a cell. Somewhere, a crate slot remains empty — and guilt rides the service shaft alone."
}
