{
  "id": 1,
  "title": "Case 1 – The Shuttered Office",
  "culprit": "lindsay",
  "brief": "A high-rise office, lights out except for one floor. Security finds a financier slumped over his desk, coffee spilled and cooling beside him. A cracked-open window lets the night breeze whisper through blinds.\n\nThe building was locked down for maintenance — no visitors, no late-night wanderers. Only three people had card access to that floor: LAWSON, the victim’s business partner; ZOE, café owner and late-shift barista; and LINDSAY, gallery curator who managed the victim’s private collection.\n\nOne of them took advantage of the silence.",
  "wrenHint": "Here’s what grates on me:\n\n• With maintenance running, only registered access cards open that floor.\n• Lawson swears he went home — but his card pings the lift minutes before time of death.\n• Zoe’s café rota checks out. Too clean, maybe… but it holds.\n• Lindsay keeps insisting the briefcase never left the gallery — yet it's here, in the office, with a fresh lock.\n\nFollow the money. Or better — follow the collection.",
  "answers": {
    "lawson": [
      "Left the office just after six. I was tired, frustrated — the merger proposal was a disaster. I took the lift, signed out, went home. Check the logs — they’ll tell you more than I can.",
      "He was my partner. We built this place from scraps. Arguments happen — raised voices don’t make me a killer.",
      "Fingerprints? Of course mine are everywhere. I practically lived in that office. If you’re expecting a clean desk, you’ve never met him."
    ],
    "zoe": [
      "Closed the café late. Maintenance meant fewer customers — easier night. The engineer bought a coffee before lockup; you’ll see his name on the slip.\nWalked home by the river. Same route I take every night.",
      "He was polite, quiet — always with a crossword. Not the type to bleed drama across a room.",
      "Prints upstairs? Only because I deliver coffee when meetings drag past midnight. I set it down, smile, and get out of the way. No snooping, no secrets."
    ],
    "lindsay": [
      "Inventory at the gallery ran long — shipments, insurance audits, deadlines. Alarm logs will show comings and goings. I didn’t go near that building.",
      "We were mid-negotiation about his private pieces joining the gallery. Mutual benefit. No motive to kill, detective — only paperwork and patience.",
      "That briefcase lived in my strong room until he wanted it closer. My prints mean I handled it professionally — before he changed the lock behind my back."
    ]
  },

  "successEnding": "{culprit} sinks into the chair as the timeline unravels.\n\n" +
                   "The access logs, the fresh lock on the briefcase, the quiet gallery transfer — everything points one way. Profit, prestige, and one late-night opportunity were all {culprit} needed.\n\n" +
                   "The arrest is silent. Outside, the city hums unaware. Tomorrow, headlines will say justice was served.",

  "failureEnding": "You press {accused} hard — too hard — until the story seems to click. They break, or pretend to, and the cuffs close around the wrong wrists.\n\n" +
                   "An hour later, Wren calls. Access logs don’t lie. Gallery records, lock history, and one overlooked card swipe all lead back to {culprit} instead.\n\n" +
                   "A mistake in the dark. Someone innocent sleeps in a cell while the real hand walks free into the city night."
}
